Documents/ИндексацияШтатногоРасписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ИндексацияШтатногоРасписания</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияПоказателейПоШтатномуРасписанию</xr:Item>
				<xr:Item>InformationRegister.ИсторияИспользованияШтатногоРасписания</xr:Item>
				<xr:Item>InformationRegister.ИсторияНачисленийПоШтатномуРасписанию</xr:Item>
				<xr:Item>InformationRegister.БазовыеПериодыИндексации</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МесяцИндексации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентИндексации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановитьБазовыйПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИндексируемыеПоказатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиРасчетаЗарплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОкругления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпособыОкругленияПриРасчетеЗарплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Позиции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПозицияШтатногоРасписания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиПозиции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкладТариф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкладТарифМин</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкладТарифМакс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФОТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФОТМин</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФОТМакс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НадбавкаЗаВредностьРазмер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НадбавкаЗаВредностьРазмерМин</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НадбавкаЗаВредностьРазмерМакс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиПозиции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиВидаРасчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начисление</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазмерМин</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазмерМакс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиПозиции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиРасчетаЗарплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяРасчетаЗарплаты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеМин</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяРасчетаЗарплаты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеМакс</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяРасчетаЗарплаты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПодчиненностьПодразделенийОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ПодчиненностьПодразделенийОрганизаций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВышестоящееПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УБРАТЬОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ИндексацияШтатногоРасписания/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	// Ограничения доступа в ролях:
	// Чтение / Изменение:
	// #ПоЗначениямРасширенный( "Документ.ИндексацияШтатногоРасписания", "","","",
	// "НЕ ЛОЖЬ В (ВЫБРАТЬ ПЕРВЫЕ 1 ЛОЖЬ ИЗ Документ.ИндексацияШтатногоРасписания.Позиции КАК Т1
	// ГДЕ Т1.Ссылка = Т.Ссылка 
	// И НЕ Т1.ПозицияШтатногоРасписания.Подразделение В (ВЫБРАТЬ РАЗЛИЧНЫЕ Т2.Подразделение ИЗ
	// РегистрСведений.ПодчиненностьПодразделенийОрганизаций КАК Т2 ГДЕ (","ПодразделенияОрганизаций",
	// "Т2.ВышестоящееПодразделение", "))) И ", "Организации","Т.Организация", "","","", "", "","", "", "","","", "","","",
	// "","","", "","","", "","","", "","","", "","","", "","","", "","","", "","","", "","","", "","","")
	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК Т
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИндексацияШтатногоРасписания.Позиции КАК Т1
	|	ПО Т1.Ссылка = Т.Ссылка
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодчиненностьПодразделенийОрганизаций КАК Т2
	|	ПО Т2.Подразделение = Т1.ПозицияШтатногоРасписания.Подразделение
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Т.Организация)
	|	И (Т1.ПозицияШтатногоРасписания.Подразделение ЕСТЬ NULL
	|		ИЛИ ДляВсехСтрок(
	|			ЗначениеРазрешено(Т2.Подразделение)
	|			ИЛИ ДляОднойИзСтрок(ЗначениеРазрешено(Т2.ВышестоящееПодразделение))))";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ЗаполнениеДокумента

Процедура ЗаполнитьФОТПозицийНачислений(Объект, МенеджерВременныхТаблиц = Неопределено, СписокПозиций = Неопределено) Экспорт
	
	ФОТПозицийНачислений = ФОТПозицийНачислений(Объект, МенеджерВременныхТаблиц, СписокПозиций);
	
	ОтборПозиции = Новый Структура("ПозицияШтатногоРасписания");
	ОтборНачисления = Новый Структура("ИдентификаторСтрокиПозиции,Начисление");
	ОтборПоказателя = Новый Структура("ИдентификаторСтрокиПозиции,Показатель");
	
	Для каждого СтрокаФОТПозиции Из ФОТПозицийНачислений.ФОТПозиций Цикл
		ОтборПозиции.Вставить("ПозицияШтатногоРасписания", СтрокаФОТПозиции.ПозицияШтатногоРасписания);  
		СтрокиПозиции = Объект.Позиции.НайтиСтроки(ОтборПозиции);
		Для каждого СтрокаПозиции Из СтрокиПозиции Цикл
			ЗаполнитьЗначенияСвойств(СтрокаПозиции, 
			СтрокаФОТПозиции, 
			"ОкладТариф,ОкладТарифМин,ОкладТарифМакс,ФОТ,ФОТМин,ФОТМакс,НадбавкаЗаВредностьРазмер,НадбавкаЗаВредностьРазмерМин,НадбавкаЗаВредностьРазмерМакс");
		КонецЦикла;
	КонецЦикла;
	
	Для каждого СтрокаФОТНачисления Из ФОТПозицийНачислений.ФОТНачислений  Цикл
		ОтборНачисления.Вставить("ИдентификаторСтрокиПозиции", СтрокаФОТНачисления.ИдентификаторСтрокиПозиции);  
		ОтборНачисления.Вставить("Начисление", СтрокаФОТНачисления.Начисление);  
		СтрокиНачисления = Объект.Начисления.НайтиСтроки(ОтборНачисления);
		Для каждого СтрокаНачисления Из СтрокиНачисления Цикл
			ЗаполнитьЗначенияСвойств(СтрокаНачисления, 
			СтрокаФОТНачисления, 
			"Размер,РазмерМин,РазмерМакс");
		КонецЦикла;
	КонецЦикла;	
КонецПроцедуры

Функция ДополненныеДанныеДокумента(Объект, МенеджерВременныхТаблиц = Неопределено, СписокПозиций = Неопределено) Экспорт
	
	СтруктураРезультатов = Новый Структура;
	
	Запрос = Новый Запрос;
	Если МенеджерВременныхТаблиц = Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		СоздатьВТПозицийШтатногоРасписания(Объект, Запрос.МенеджерВременныхТаблиц, СписокПозиций);
	Иначе
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ИндексируемыеПоказатели", Объект.ИндексируемыеПоказатели.Выгрузить( ,"Показатель").ВыгрузитьКолонку("Показатель"));
	Запрос.УстановитьПараметр("Позиции", Объект.Позиции.Выгрузить());
	Запрос.УстановитьПараметр("Начисления", Объект.Начисления.Выгрузить());
	Запрос.УстановитьПараметр("Показатели", Объект.Показатели.Выгрузить());
	Запрос.УстановитьПараметр("ДатаИндексации", Объект.МесяцИндексации);
	Запрос.УстановитьПараметр("УстановитьБазовыйПериод", Объект.УстановитьБазовыйПериод);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Позиции.ПозицияШтатногоРасписания,
		|	Позиции.ИдентификаторСтрокиПозиции,
		|	Позиции.ОкладТариф КАК ОкладТариф,
		|	Позиции.ОкладТарифМин КАК ОкладТарифМин,
		|	Позиции.ОкладТарифМакс КАК ОкладТарифМакс,
		|	Позиции.ФОТ КАК ФОТ,
		|	Позиции.ФОТМин КАК ФОТМин,
		|	Позиции.ФОТМакс КАК ФОТМакс,
		|	Позиции.НадбавкаЗаВредностьРазмер КАК НадбавкаЗаВредностьРазмер,
		|	Позиции.НадбавкаЗаВредностьРазмерМин КАК НадбавкаЗаВредностьРазмерМин,
		|	Позиции.НадбавкаЗаВредностьРазмерМакс КАК НадбавкаЗаВредностьРазмерМакс
		|ПОМЕСТИТЬ ВТПозицииИзДокумента
		|ИЗ
		|	&Позиции КАК Позиции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Начисления.Начисление,
		|	Начисления.ИдентификаторСтрокиПозиции,
		|	Начисления.ИдентификаторСтрокиВидаРасчета,
		|	Начисления.Размер,
		|	Начисления.РазмерМин,
		|	Начисления.РазмерМакс
		|ПОМЕСТИТЬ ВТПараметрНачисления
		|ИЗ
		|	&Начисления КАК Начисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Показатели.Показатель,
		|	Показатели.ИдентификаторСтрокиПозиции,
		|	Показатели.Значение,
		|	Показатели.ЗначениеМин,
		|	Показатели.ЗначениеМакс
		|ПОМЕСТИТЬ ВТПараметрПоказатели
		|ИЗ
		|	&Показатели КАК Показатели
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПозицииИзДокумента.ПозицияШтатногоРасписания,
		|	Начисления.Начисление,
		|	Начисления.ИдентификаторСтрокиПозиции,
		|	Начисления.ИдентификаторСтрокиВидаРасчета,
		|	Начисления.Размер,
		|	Начисления.РазмерМин,
		|	Начисления.РазмерМакс
		|ПОМЕСТИТЬ ВТНачисления
		|ИЗ
		|	ВТПозицииИзДокумента КАК ПозицииИзДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПараметрНачисления КАК Начисления
		|		ПО ПозицииИзДокумента.ИдентификаторСтрокиПозиции = Начисления.ИдентификаторСтрокиПозиции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПозицииИзДокумента.ПозицияШтатногоРасписания,
		|	Показатели.Показатель,
		|	Показатели.ИдентификаторСтрокиПозиции,
		|	Показатели.Значение,
		|	Показатели.ЗначениеМин,
		|	Показатели.ЗначениеМакс
		|ПОМЕСТИТЬ ВТПоказатели
		|ИЗ
		|	ВТПозицииИзДокумента КАК ПозицииИзДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПараметрПоказатели КАК Показатели
		|		ПО ПозицииИзДокумента.ИдентификаторСтрокиПозиции = Показатели.ИдентификаторСтрокиПозиции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПозицииШтатногоРасписания.ПозицияШтатногоРасписания,
		|	ПозицииШтатногоРасписания.ИдентификаторСтрокиПозиции КАК ИдентификаторСтрокиПозиции,
		|	Начисления.ИдентификаторСтрокиВидаРасчета КАК ИдентификаторСтрокиВидаРасчета,
		|	Начисления.Начисление КАК Начисление,
		|	Начисления.Размер КАК Размер,
		|	Начисления.РазмерМин КАК РазмерМин,
		|	Начисления.РазмерМакс КАК РазмерМакс,
		|	НачисленияПозицийШтатногоРасписания.Показатель КАК Показатель,
		|	НачисленияПозицийШтатногоРасписания.Значение КАК Значение,
		|	НачисленияПозицийШтатногоРасписания.ЗначениеМин КАК ЗначениеМин,
		|	НачисленияПозицийШтатногоРасписания.ЗначениеМакс КАК ЗначениеМакс
		|ПОМЕСТИТЬ ВТОбновленныеНачисления
		|ИЗ
		|	ВТПозицииИзДокумента КАК ПозицииШтатногоРасписания
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияПозицийШтатногоРасписания КАК НачисленияПозицийШтатногоРасписания
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисления КАК Начисления
		|			ПО НачисленияПозицийШтатногоРасписания.ПозицияШтатногоРасписания = Начисления.ПозицияШтатногоРасписания
		|				И НачисленияПозицийШтатногоРасписания.Начисление = Начисления.Начисление
		|		ПО ПозицииШтатногоРасписания.ПозицияШтатногоРасписания = НачисленияПозицийШтатногоРасписания.ПозицияШтатногоРасписания
		|ГДЕ
		|	НачисленияПозицийШтатногоРасписания.Начисление <> ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбновленныеНачисления.ПозицияШтатногоРасписания,
		|	ОбновленныеНачисления.ИдентификаторСтрокиПозиции КАК ИдентификаторСтрокиПозиции,
		|	ОбновленныеНачисления.ИдентификаторСтрокиВидаРасчета КАК ИдентификаторСтрокиВидаРасчета,
		|	ОбновленныеНачисления.Начисление КАК Начисление,
		|	ОбновленныеНачисления.Размер КАК Размер,
		|	ОбновленныеНачисления.РазмерМин КАК РазмерМин,
		|	ОбновленныеНачисления.РазмерМакс КАК РазмерМакс,
		|	ОбновленныеНачисления.Показатель КАК Показатель,
		|	ЕСТЬNULL(Показатели.Значение, ОбновленныеНачисления.Значение) КАК Значение,
		|	ЕСТЬNULL(Показатели.ЗначениеМин, ОбновленныеНачисления.ЗначениеМин) КАК ЗначениеМин,
		|	ЕСТЬNULL(Показатели.ЗначениеМакс, ОбновленныеНачисления.ЗначениеМакс) КАК ЗначениеМакс
		|ПОМЕСТИТЬ ВТНачисленияПоказателиИзДокумента
		|ИЗ
		|	ВТОбновленныеНачисления КАК ОбновленныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказатели КАК Показатели
		|		ПО ОбновленныеНачисления.Показатель = Показатели.Показатель
		|			И ОбновленныеНачисления.ПозицияШтатногоРасписания = Показатели.ПозицияШтатногоРасписания";
	
	Запрос.Выполнить();
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	&ДатаИндексации КАК Дата,
		|	ПозицииДокумента.ПозицияШтатногоРасписания,
		|	ПозицииДокумента.ИдентификаторСтрокиПозиции,
		|	ПозицииДокумента.ОкладТариф КАК ОкладТариф,
		|	ПозицииДокумента.ОкладТарифМин КАК ОкладТарифМин,
		|	ПозицииДокумента.ОкладТарифМакс КАК ОкладТарифМакс,
		|	ПозицииДокумента.ФОТ КАК ФОТ,
		|	ПозицииДокумента.ФОТМин КАК ФОТМин,
		|	ПозицииДокумента.ФОТМакс КАК ФОТМакс,
		|	ПозицииДокумента.НадбавкаЗаВредностьРазмер КАК НадбавкаЗаВредностьРазмер,
		|	ПозицииДокумента.НадбавкаЗаВредностьРазмерМин КАК НадбавкаЗаВредностьРазмерМин,
		|	ПозицииДокумента.НадбавкаЗаВредностьРазмерМакс КАК НадбавкаЗаВредностьРазмерМакс,
		|	ЗНАЧЕНИЕ(Перечисление.ДействияСПозициямиШтатногоРасписания.ПустаяСсылка) КАК Действие,
		|	ИСТИНА КАК Используется,
		|	ПозицииШтатногоРасписания.*
		|ИЗ
		|	ВТПозицииИзДокумента КАК ПозицииДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПозицииШтатногоРасписания КАК ПозицииШтатногоРасписания
		|		ПО (ПозицииШтатногоРасписания.ПозицияШтатногоРасписания = ПозицииДокумента.ПозицияШтатногоРасписания)";
	
	СтруктураРезультатов.Вставить("РезультатЗапросаПозиций", Запрос.Выполнить());
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	&ДатаИндексации КАК Дата,
		|	НачисленияПозицийШтатногоРасписания.ПозицияШтатногоРасписания,
		|	НачисленияПозицийШтатногоРасписания.ИдентификаторСтрокиПозиции КАК ИдентификаторСтрокиПозиции,
		|	НачисленияПозицийШтатногоРасписания.ИдентификаторСтрокиВидаРасчета КАК ИдентификаторСтрокиВидаРасчета,
		|	НачисленияПозицийШтатногоРасписания.Начисление КАК Начисление,
		|	МАКСИМУМ(НачисленияПозицийШтатногоРасписания.Размер) КАК Размер,
		|	МИНИМУМ(НачисленияПозицийШтатногоРасписания.РазмерМин) КАК РазмерМин,
		|	МАКСИМУМ(НачисленияПозицийШтатногоРасписания.РазмерМакс) КАК РазмерМакс,
		|	ЗНАЧЕНИЕ(Перечисление.ДействияСНачислениямиИУдержаниями.ПустаяСсылка) КАК Действие
		|ИЗ
		|	ВТНачисленияПоказателиИзДокумента КАК НачисленияПозицийШтатногоРасписания
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияПозицийШтатногоРасписания.ИдентификаторСтрокиВидаРасчета,
		|	НачисленияПозицийШтатногоРасписания.Начисление,
		|	НачисленияПозицийШтатногоРасписания.ПозицияШтатногоРасписания,
		|	НачисленияПозицийШтатногоРасписания.ИдентификаторСтрокиПозиции";
	
	СтруктураРезультатов.Вставить("РезультатЗапросаНачислений", Запрос.Выполнить());
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	&ДатаИндексации КАК Дата,
		|	НачисленияПозицийШтатногоРасписания.ПозицияШтатногоРасписания,
		|	НачисленияПозицийШтатногоРасписания.ИдентификаторСтрокиПозиции КАК ИдентификаторСтрокиПозиции,
		|	НачисленияПозицийШтатногоРасписания.ИдентификаторСтрокиВидаРасчета КАК ИдентификаторСтрокиВидаРасчета,
		|	НачисленияПозицийШтатногоРасписания.Показатель КАК Показатель,
		|	НачисленияПозицийШтатногоРасписания.Значение КАК Значение,
		|	НачисленияПозицийШтатногоРасписания.ЗначениеМин КАК ЗначениеМин,
		|	НачисленияПозицийШтатногоРасписания.ЗначениеМакс КАК ЗначениеМакс,
		|	ПоказателиРасчетаЗарплаты.Точность
		|ИЗ
		|	ВТНачисленияПоказателиИзДокумента КАК НачисленияПозицийШтатногоРасписания
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПоказателиРасчетаЗарплаты КАК ПоказателиРасчетаЗарплаты
		|		ПО НачисленияПозицийШтатногоРасписания.Показатель = ПоказателиРасчетаЗарплаты.Ссылка";
	
	СтруктураРезультатов.Вставить("РезультатЗапросаПоказателей", Запрос.Выполнить());
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	&ДатаИндексации КАК Период,
		|	&Организация КАК Организация,
		|	ПозицииДокумента.ПозицияШтатногоРасписания.Подразделение КАК Подразделение,
		|	ПозицииДокумента.ПозицияШтатногоРасписания.Должность КАК Должность
		|ИЗ
		|	ВТПозицииИзДокумента КАК ПозицииДокумента
		|ГДЕ
		|	&УстановитьБазовыйПериод = ИСТИНА";
	
	СтруктураРезультатов.Вставить("БазовыеПериодыИндексации", Запрос.Выполнить().Выгрузить());
	
	
	Возврат СтруктураРезультатов;
	
КонецФункции 

Функция ТекущиеДанныеПозиций(Объект, МенеджерВременныхТаблиц = Неопределено, СписокПозиций = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Если МенеджерВременныхТаблиц = Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Иначе	
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	КонецЕсли;
	
	СоздатьВТПозицийШтатногоРасписания(Объект, Запрос.МенеджерВременныхТаблиц, СписокПозиций, Ложь);
	
	ИспользоватьТарифныеСеткиПриРасчетеЗарплаты = ПолучитьФункциональнуюОпцию("ИспользоватьТарифныеСеткиПриРасчетеЗарплаты");
	Запрос.УстановитьПараметр("ИспользоватьТарифныеСеткиПриРасчетеЗарплаты", ИспользоватьТарифныеСеткиПриРасчетеЗарплаты);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПозицииШтатногоРасписания.ПозицияШтатногоРасписания
		|ПОМЕСТИТЬ ВТПозицииДокумента
		|ИЗ
		|	ВТПозицииШтатногоРасписания КАК ПозицииШтатногоРасписания
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНачисленияПозицийШтатногоРасписания КАК НачисленияПозицийШтатногоРасписания
		|		ПО ПозицииШтатногоРасписания.ПозицияШтатногоРасписания = НачисленияПозицийШтатногоРасписания.ПозицияШтатногоРасписания
		|ГДЕ
		|	НачисленияПозицийШтатногоРасписания.Показатель В(&Показатели)
		|	И (НЕ &ИспользоватьТарифныеСеткиПриРасчетеЗарплаты
		|			ИЛИ ПозицииШтатногоРасписания.ТарифнаяСетка = ЗНАЧЕНИЕ(Справочник.ТарифныеСетки.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПозицииШтатногоРасписания.ПозицияШтатногоРасписания,
		|	ПозицииШтатногоРасписания.ОкладТариф КАК ОкладТариф,
		|	ПозицииШтатногоРасписания.ОкладТарифМин КАК ОкладТарифМин,
		|	ПозицииШтатногоРасписания.ОкладТарифМакс КАК ОкладТарифМакс,
		|	ПозицииШтатногоРасписания.ФОТ КАК ФОТ,
		|	ПозицииШтатногоРасписания.ФОТМин КАК ФОТМин,
		|	ПозицииШтатногоРасписания.ФОТМакс КАК ФОТМакс,
		|	ПозицииШтатногоРасписания.НадбавкаЗаВредностьРазмер КАК НадбавкаЗаВредностьРазмер,
		|	ПозицииШтатногоРасписания.НадбавкаЗаВредностьРазмерМин КАК НадбавкаЗаВредностьРазмерМин,
		|	ПозицииШтатногоРасписания.НадбавкаЗаВредностьРазмерМакс КАК НадбавкаЗаВредностьРазмерМакс
		|ИЗ
		|	ВТПозицииШтатногоРасписания КАК ПозицииШтатногоРасписания
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПозицииДокумента КАК ВТПозицииДокумента
		|		ПО ПозицииШтатногоРасписания.ПозицияШтатногоРасписания = ВТПозицииДокумента.ПозицияШтатногоРасписания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПозицииШтатногоРасписания.ПозицияШтатногоРасписания,
		|	НачисленияПозицийШтатногоРасписания.Начисление КАК Начисление,
		|	МАКСИМУМ(НачисленияПозицийШтатногоРасписания.Размер) КАК Размер,
		|	МИНИМУМ(НачисленияПозицийШтатногоРасписания.РазмерМин) КАК РазмерМин,
		|	МАКСИМУМ(НачисленияПозицийШтатногоРасписания.РазмерМакс) КАК РазмерМакс,
		|	ВЫРАЗИТЬ(НачисленияПозицийШтатногоРасписания.Начисление КАК ПланВидовРасчета.Начисления).РеквизитДопУпорядочивания КАК Порядок
		|ИЗ
		|	ВТПозицииДокумента КАК ПозицииШтатногоРасписания
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияПозицийШтатногоРасписания КАК НачисленияПозицийШтатногоРасписания
		|		ПО ПозицииШтатногоРасписания.ПозицияШтатногоРасписания = НачисленияПозицийШтатногоРасписания.ПозицияШтатногоРасписания
		|ГДЕ
		|	НачисленияПозицийШтатногоРасписания.Начисление <> ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПозицииШтатногоРасписания.ПозицияШтатногоРасписания,
		|	НачисленияПозицийШтатногоРасписания.Начисление
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПозицииШтатногоРасписания.ПозицияШтатногоРасписания,
		|	НачисленияПозицийШтатногоРасписания.Показатель КАК Показатель,
		|	МАКСИМУМ(НачисленияПозицийШтатногоРасписания.Значение) КАК Значение,
		|	МИНИМУМ(НачисленияПозицийШтатногоРасписания.ЗначениеМин) КАК ЗначениеМин,
		|	МАКСИМУМ(НачисленияПозицийШтатногоРасписания.ЗначениеМакс) КАК ЗначениеМакс,
		|	ПоказателиРасчетаЗарплаты.Точность
		|ИЗ
		|	ВТПозицииДокумента КАК ПозицииШтатногоРасписания
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияПозицийШтатногоРасписания КАК НачисленияПозицийШтатногоРасписания
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПоказателиРасчетаЗарплаты КАК ПоказателиРасчетаЗарплаты
		|			ПО НачисленияПозицийШтатногоРасписания.Показатель = ПоказателиРасчетаЗарплаты.Ссылка
		|		ПО ПозицииШтатногоРасписания.ПозицияШтатногоРасписания = НачисленияПозицийШтатногоРасписания.ПозицияШтатногоРасписания
		|ГДЕ
		|	НачисленияПозицийШтатногоРасписания.Начисление <> ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ПустаяСсылка)
		|	И НачисленияПозицийШтатногоРасписания.Показатель В(&Показатели)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПозицииШтатногоРасписания.ПозицияШтатногоРасписания,
		|	НачисленияПозицийШтатногоРасписания.Показатель,
		|	ПоказателиРасчетаЗарплаты.Точность";
	
	Запрос.УстановитьПараметр("Показатели", Объект.ИндексируемыеПоказатели.Выгрузить( ,"Показатель").ВыгрузитьКолонку("Показатель"));
	
	Результат = Запрос.ВыполнитьПакет();
	
	КоличествоРезультатов = Результат.Количество();
	
	СтруктураРезультатов = Новый Структура;
	СтруктураРезультатов.Вставить("РезультатЗапросаПозиций", Результат[КоличествоРезультатов - 3]);
	СтруктураРезультатов.Вставить("РезультатЗапросаНачислений", Результат[КоличествоРезультатов - 2]);
	СтруктураРезультатов.Вставить("РезультатЗапросаПоказателей", Результат[КоличествоРезультатов - 1]);
	
	Возврат СтруктураРезультатов;
	
КонецФункции 

Функция ФОТПозицийНачислений(Объект, МенеджерВременныхТаблиц = Неопределено, СписокПозиций = Неопределено)
	// Дополним данные документа данными учета.
	ДополненныеДанныеДокумента = ДополненныеДанныеДокумента(Объект, МенеджерВременныхТаблиц, СписокПозиций);
	
	ТЗПозиции = ДополненныеДанныеДокумента["РезультатЗапросаПозиций"].Выгрузить();
	ТЗНачисления = ДополненныеДанныеДокумента["РезультатЗапросаНачислений"].Выгрузить();
	ТЗПоказатели = ДополненныеДанныеДокумента["РезультатЗапросаПоказателей"].Выгрузить();
	
	ТЗПозиции.Колонки["ПозицияШтатногоРасписания"].Имя 		= "Позиция";
	ТЗНачисления.Колонки["ПозицияШтатногоРасписания"].Имя 	= "Позиция";
	ТЗПоказатели.Колонки["ПозицияШтатногоРасписания"].Имя 	= "Позиция";
	
	РассчитатьФОТ(Объект, ТЗПозиции, ТЗНачисления, ТЗПоказатели);
	
	ТЗПозиции.Колонки["Позиция"].Имя 		= "ПозицияШтатногоРасписания";
	ТЗНачисления.Колонки["Позиция"].Имя 	= "ПозицияШтатногоРасписания";
	ТЗПоказатели.Колонки["Позиция"].Имя 	= "ПозицияШтатногоРасписания";
	
	ФОТПозицийНачислений = Новый Структура;
	ФОТПозицийНачислений.Вставить("ФОТПозиций", ТЗПозиции);
	ФОТПозицийНачислений.Вставить("ФОТНачислений", ТЗНачисления);
	
	Возврат ФОТПозицийНачислений
	
КонецФункции

Процедура РассчитатьФОТ(Объект, КоллекцияПозиций, КоллекцияНачислений, КоллекцияПоказателей)
	
	ОписаниеПозиций = Новый Структура;
	ОписаниеПозиций.Вставить("Организация", Объект.Организация);
	ОписаниеПозиций.Вставить("ДатаВступленияВСилу", Объект.МесяцИндексации);
	ОписаниеПозиций.Вставить("Позиции", КоллекцияПозиций);
	ОписаниеПозиций.Вставить("Начисления", КоллекцияНачислений);
	ОписаниеПозиций.Вставить("Показатели", КоллекцияПоказателей);
	
	УправлениеШтатнымРасписанием.РассчитатьФОТНесколькихПозиций(ОписаниеПозиций);

КонецПроцедуры

Процедура СоздатьВТПозицийШтатногоРасписания(Объект, МенеджерВременныхТаблиц, СписокПозиций = Неопределено, ПолноеОписание = Ложь) Экспорт
	
	Параметры = УправлениеШтатнымРасписанием.ПараметрыПолученияПозицийШтатногоРасписания();
	Параметры.Организация 		= Объект.Организация;
	Параметры.Подразделение 	= Объект.Подразделение;
	Параметры.ДатаАктуальности 	= Объект.МесяцИндексации - 1;
	
	Если НЕ СписокПозиций = Неопределено Тогда
		Параметры.ПозицииШтатногоРасписания 	= СписокПозиций;
	КонецЕсли;
	
	УправлениеШтатнымРасписанием.СоздатьВТПозицииШтатногоРасписания(Истина, МенеджерВременныхТаблиц, "ВТПозицииШтатногоРасписания", Параметры);
	
	ОписательВременныхТаблиц = УправлениеШтатнымРасписанием.ОписательВременныхТаблицДляПолученияДанныхПозицийШтатногоРасписания(
	МенеджерВременныхТаблиц,
	"ВТПозицииШтатногоРасписания");
	
	УправлениеШтатнымРасписанием.СоздатьВТНачисленияПозицийШтатногоРасписания(Истина, ОписательВременныхТаблиц, "ВТНачисленияПозицийШтатногоРасписания", ПолноеОписание);
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
